In [2]:
import torch
import numpy as np
import pandas as pd
import os
import time
from glob import glob
from itertools import cycle

In [3]:
dirs = '../M5_Dataset'

In [4]:
INPUT_DIR = dirs

calendar = pd.read_csv(f'{INPUT_DIR}/calendar.csv')
calendar.name = 'calendar'

prices = pd.read_csv(f'{INPUT_DIR}/sell_prices.csv')
prices.name = 'prices'

sales = pd.read_csv(f'{INPUT_DIR}/sales_train_evaluation.csv')
sales.name = 'sales'

In [24]:
def downcast(df):
    cols = df.dtypes.index.tolist()
    types = df.dtypes.values.tolist()
    for i,t in enumerate(types):
        if 'int' in str(t):
            if df[cols[i]].min() > np.iinfo(np.int8).min and df[cols[i]].max() < np.iinfo(np.int8).max:
                df[cols[i]] = df[cols[i]].astype(np.int8)
            elif df[cols[i]].min() > np.iinfo(np.int16).min and df[cols[i]].max() < np.iinfo(np.int16).max:
                df[cols[i]] = df[cols[i]].astype(np.int16)
            elif df[cols[i]].min() > np.iinfo(np.int32).min and df[cols[i]].max() < np.iinfo(np.int32).max:
                df[cols[i]] = df[cols[i]].astype(np.int32)
            else:
                df[cols[i]] = df[cols[i]].astype(np.int64)
        elif 'float' in str(t):
            if df[cols[i]].min() > np.finfo(np.float16).min and df[cols[i]].max() < np.finfo(np.float16).max:
                df[cols[i]] = df[cols[i]].astype(np.float16)
            elif df[cols[i]].min() > np.finfo(np.float32).min and df[cols[i]].max() < np.finfo(np.float32).max:
                df[cols[i]] = df[cols[i]].astype(np.float32)
            else:
                df[cols[i]] = df[cols[i]].astype(np.float64)
        elif t == object:
            if cols[i] == 'date':
                df[cols[i]] = pd.to_datetime(df[cols[i]], format='%Y-%m-%d')
            else:
                df[cols[i]] = df[cols[i]].astype('category')
    return df  

sales = downcast(sales)
prices = downcast(prices)
calendar = downcast(calendar)

In [152]:
df = sales.groupby(['store_id', 'dept_id']).sum()

index_list = df.index

df.reset_index(inplace=True)


idx_list = []
state_list = []
cat_list = []

for i in range(len(index_list)):
    idx = index_list[i][0] + '_' + index_list[i][1]
    idx_list.append(idx)
    
    state = df.iloc[i]['store_id'].split('_')
    state_list.append(state[0])
    
    cat = df.iloc[i]['dept_id'].split('_')
    cat_list.append(cat[0])
    
df['Node'] = idx_list
df['Node'] = df['Node'].astype('category')

# df.set_index('index', inplace=True)

In [153]:
df['state_id'] = state_list
df['state_id'] = df['state_id'].astype('category')

df['cat_id'] = cat_list
df['cat_id'] = df['cat_id'].astype('category')

In [154]:
df

,store_id,dept_id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,...,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941,Node,state_id,cat_id
0,CA_1,FOODS_1,297,284,214,175,182,191,224,263,...,277.0,302.0,397.0,330.0,310.0,427,334.0,CA_1_FOODS_1,CA,FOODS
1,CA_1,FOODS_2,674,655,396,476,354,486,554,747,...,555.0,476.0,427.0,411.0,434.0,627,719.0,CA_1_FOODS_2,CA,FOODS
2,CA_1,FOODS_3,2268,2198,1398,1607,1496,1730,1915,2952,...,2366.0,2016.0,1992.0,2113.0,2249.0,2729,3274.0,CA_1_FOODS_3,CA,FOODS
3,CA_1,HOBBIES_1,528,489,409,383,263,453,339,750,...,389.0,347.0,353.0,354.0,494.0,656,588.0,CA_1_HOBBIES_1,CA,HOBBIES
4,CA_1,HOBBIES_2,28,9,6,9,5,14,7,19,...,28.0,46.0,28.0,52.0,45.0,63,58.0,CA_1_HOBBIES_2,CA,HOBBIES
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
65,WI_3,FOODS_3,2293,2383,1841,1965,1427,2760,2727,3786,...,1952.0,1602.0,1594.0,1627.0,2011.0,2360,2632.0,WI_3_FOODS_3,WI,FOODS
66,WI_3,HOBBIES_1,256,342,228,183,70,285,357,399,...,187.0,174.0,287.0,220.0,242.0,273,305.0,WI_3_HOBBIES_1,WI,HOBBIES
67,WI_3,HOBBIES_2,22,14,20,11,4,8,3,13,...,11.0,45.0,45.0,46.0,27.0,31,37.0,WI_3_HOBBIES_2,WI,HOBBIES
68,WI_3,HOUSEHOLD_1,584,541,420,327,151,392,492,647,...,626.0,597.0,486.0,595.0,764.0,723,723.0,WI_3_HOUSEHOLD_1,WI,HOUSEHOLD
69,WI_3,HOUSEHOLD_2,148,195,106,94,53,122,159,186,...,138.0,132.0,133.0,141.0,230.0,218,208.0,WI_3_HOUSEHOLD_2,WI,HOUSEHOLD

In [155]:
df_melt = pd.melt(df, id_vars=['store_id', 'dept_id', 'state_id', 'cat_id','Node'], var_name='d', value_name='sold').dropna()

In [156]:
df_melt

,store_id,dept_id,state_id,cat_id,Node,d,sold
0,CA_1,FOODS_1,CA,FOODS,CA_1_FOODS_1,d_1,297.0
1,CA_1,FOODS_2,CA,FOODS,CA_1_FOODS_2,d_1,674.0
2,CA_1,FOODS_3,CA,FOODS,CA_1_FOODS_3,d_1,2268.0
3,CA_1,HOBBIES_1,CA,HOBBIES,CA_1_HOBBIES_1,d_1,528.0
4,CA_1,HOBBIES_2,CA,HOBBIES,CA_1_HOBBIES_2,d_1,28.0
...,...,...,...,...,...,...,...
135865,WI_3,FOODS_3,WI,FOODS,WI_3_FOODS_3,d_1941,2632.0
135866,WI_3,HOBBIES_1,WI,HOBBIES,WI_3_HOBBIES_1,d_1941,305.0
135867,WI_3,HOBBIES_2,WI,HOBBIES,WI_3_HOBBIES_2,d_1941,37.0
135868,WI_3,HOUSEHOLD_1,WI,HOUSEHOLD,WI_3_HOUSEHOLD_1,d_1941,723.0
135869,WI_3,HOUSEHOLD_2,WI,HOUSEHOLD,WI_3_HOUSEHOLD_2,d_1941,208.0

In [181]:
df_concat_calendar = pd.merge(df_melt, calendar, on='d', how='left')

In [182]:
df_concat_calendar

,store_id,dept_id,state_id,cat_id,Node,d,sold,date,wm_yr_wk,weekday,wday,month,year,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,CA_1,FOODS_1,CA,FOODS,CA_1_FOODS_1,d_1,297.0,2011-01-29,11101,Saturday,1,1,2011,NaN,NaN,NaN,NaN,0,0,0
1,CA_1,FOODS_2,CA,FOODS,CA_1_FOODS_2,d_1,674.0,2011-01-29,11101,Saturday,1,1,2011,NaN,NaN,NaN,NaN,0,0,0
2,CA_1,FOODS_3,CA,FOODS,CA_1_FOODS_3,d_1,2268.0,2011-01-29,11101,Saturday,1,1,2011,NaN,NaN,NaN,NaN,0,0,0
3,CA_1,HOBBIES_1,CA,HOBBIES,CA_1_HOBBIES_1,d_1,528.0,2011-01-29,11101,Saturday,1,1,2011,NaN,NaN,NaN,NaN,0,0,0
4,CA_1,HOBBIES_2,CA,HOBBIES,CA_1_HOBBIES_2,d_1,28.0,2011-01-29,11101,Saturday,1,1,2011,NaN,NaN,NaN,NaN,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
135865,WI_3,FOODS_3,WI,FOODS,WI_3_FOODS_3,d_1941,2632.0,2016-05-22,11617,Sunday,2,5,2016,NaN,NaN,NaN,NaN,0,0,0
135866,WI_3,HOBBIES_1,WI,HOBBIES,WI_3_HOBBIES_1,d_1941,305.0,2016-05-22,11617,Sunday,2,5,2016,NaN,NaN,NaN,NaN,0,0,0
135867,WI_3,HOBBIES_2,WI,HOBBIES,WI_3_HOBBIES_2,d_1941,37.0,2016-05-22,11617,Sunday,2,5,2016,NaN,NaN,NaN,NaN,0,0,0
135868,WI_3,HOUSEHOLD_1,WI,HOUSEHOLD,WI_3_HOUSEHOLD_1,d_1941,723.0,2016-05-22,11617,Sunday,2,5,2016,NaN,NaN,NaN,NaN,0,0,0
135869,WI_3,HOUSEHOLD_2,WI,HOUSEHOLD,WI_3_HOUSEHOLD_2,d_1941,208.0,2016-05-22,11617,Sunday,2,5,2016,NaN,NaN,NaN,NaN,0,0,0

In [183]:
temp = df_concat_calendar

In [184]:
d_dept_id = dict(zip(temp.dept_id.cat.codes, temp.dept_id))
d_cat_id = dict(zip(temp.cat_id.cat.codes, temp.cat_id))
d_store_id = dict(zip(temp.store_id.cat.codes, temp.store_id))
d_state_id = dict(zip(temp.state_id.cat.codes, temp.state_id))
d_node = dict(zip(temp.Node.cat.codes, temp.Node))

In [185]:
temp.d = temp['d'].apply(lambda x: x.split('_')[1]).astype(np.int16)

In [186]:
cols = temp.dtypes.index.tolist()
cols

['store_id',
 'dept_id',
 'state_id',
 'cat_id',
 'Node',
 'd',
 'sold',
 'date',
 'wm_yr_wk',
 'weekday',
 'wday',
 'month',
 'year',
 'event_name_1',
 'event_type_1',
 'event_name_2',
 'event_type_2',
 'snap_CA',
 'snap_TX',
 'snap_WI']

In [187]:
types = temp.dtypes.values.tolist()
types

[CategoricalDtype(categories=['CA_1', 'CA_2', 'CA_3', 'CA_4', 'TX_1', 'TX_2', 'TX_3',
                   'WI_1', 'WI_2', 'WI_3'],
 , ordered=False),
 CategoricalDtype(categories=['FOODS_1', 'FOODS_2', 'FOODS_3', 'HOBBIES_1', 'HOBBIES_2',
                   'HOUSEHOLD_1', 'HOUSEHOLD_2'],
 , ordered=False),
 CategoricalDtype(categories=['CA', 'TX', 'WI'], ordered=False),
 CategoricalDtype(categories=['FOODS', 'HOBBIES', 'HOUSEHOLD'], ordered=False),
 CategoricalDtype(categories=['CA_1_FOODS_1', 'CA_1_FOODS_2', 'CA_1_FOODS_3',
                   'CA_1_HOBBIES_1', 'CA_1_HOBBIES_2', 'CA_1_HOUSEHOLD_1',
                   'CA_1_HOUSEHOLD_2', 'CA_2_FOODS_1', 'CA_2_FOODS_2',
                   'CA_2_FOODS_3', 'CA_2_HOBBIES_1', 'CA_2_HOBBIES_2',
                   'CA_2_HOUSEHOLD_1', 'CA_2_HOUSEHOLD_2', 'CA_3_FOODS_1',
                   'CA_3_FOODS_2', 'CA_3_FOODS_3', 'CA_3_HOBBIES_1',
                   'CA_3_HOBBIES_2', 'CA_3_HOUSEHOLD_1', 'CA_3_HOUSEHOLD_2',
                   'CA_4_FOODS_1', 'CA_4_FOODS_2', 'CA_4_FOODS_3',
                   'CA_4_HOBBIES_1', 'CA_4_HOBBIES_2', 'CA_4_HOUSEHOLD_1',
                   'CA_4_HOUSEHOLD_2', 'TX_1_FOODS_1', 'TX_1_FOODS_2',
                   'TX_1_FOODS_3', 'TX_1_HOBBIES_1', 'TX_1_HOBBIES_2',
                   'TX_1_HOUSEHOLD_1', 'TX_1_HOUSEHOLD_2', 'TX_2_FOODS_1',
                   'TX_2_FOODS_2', 'TX_2_FOODS_3', 'TX_2_HOBBIES_1',
                   'TX_2_HOBBIES_2', 'TX_2_HOUSEHOLD_1', 'TX_2_HOUSEHOLD_2',
                   'TX_3_FOODS_1', 'TX_3_FOODS_2', 'TX_3_FOODS_3',
                   'TX_3_HOBBIES_1', 'TX_3_HOBBIES_2', 'TX_3_HOUSEHOLD_1',
                   'TX_3_HOUSEHOLD_2', 'WI_1_FOODS_1', 'WI_1_FOODS_2',
                   'WI_1_FOODS_3', 'WI_1_HOBBIES_1', 'WI_1_HOBBIES_2',
                   'WI_1_HOUSEHOLD_1', 'WI_1_HOUSEHOLD_2', 'WI_2_FOODS_1',
                   'WI_2_FOODS_2', 'WI_2_FOODS_3', 'WI_2_HOBBIES_1',
                   'WI_2_HOBBIES_2', 'WI_2_HOUSEHOLD_1', 'WI_2_HOUSEHOLD_2',
                   'WI_3_FOODS_1', 'WI_3_FOODS_2', 'WI_3_FOODS_3',
                   'WI_3_HOBBIES_1', 'WI_3_HOBBIES_2', 'WI_3_HOUSEHOLD_1',
                   'WI_3_HOUSEHOLD_2'],
 , ordered=False),
 dtype('int16'),
 dtype('float64'),
 dtype('<M8[ns]'),
 dtype('int16'),
 CategoricalDtype(categories=['Friday', 'Monday', 'Saturday', 'Sunday', 'Thursday',
                   'Tuesday', 'Wednesday'],
 , ordered=False),
 dtype('int8'),
 dtype('int8'),
 dtype('int16'),
 CategoricalDtype(categories=['Chanukah End', 'Christmas', 'Cinco De Mayo', 'ColumbusDay',
                   'Easter', 'Eid al-Fitr', 'EidAlAdha', 'Father's day',
                   'Halloween', 'IndependenceDay', 'LaborDay', 'LentStart',
                   'LentWeek2', 'MartinLutherKingDay', 'MemorialDay',
                   'Mother's day', 'NBAFinalsEnd', 'NBAFinalsStart', 'NewYear',
                   'OrthodoxChristmas', 'OrthodoxEaster', 'Pesach End',
                   'PresidentsDay', 'Purim End', 'Ramadan starts',
                   'StPatricksDay', 'SuperBowl', 'Thanksgiving',
                   'ValentinesDay', 'VeteransDay'],
 , ordered=False),
 CategoricalDtype(categories=['Cultural', 'National', 'Religious', 'Sporting'], ordered=False),
 CategoricalDtype(categories=['Cinco De Mayo', 'Easter', 'Father's day', 'OrthodoxEaster'], ordered=False),
 CategoricalDtype(categories=['Cultural', 'Religious'], ordered=False),
 dtype('int8'),
 dtype('int8'),
 dtype('int8')]

In [188]:
for i,type in enumerate(types):
    if type.name == 'category':
        temp[cols[i]] = temp[cols[i]].cat.codes

In [190]:
temp.drop('date',axis=1,inplace=True)
temp.drop('wm_yr_wk',axis=1,inplace=True)

In [191]:
temp

,store_id,dept_id,state_id,cat_id,Node,d,sold,weekday,wday,month,year,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,0,0,0,0,0,1,297.0,2,1,1,2011,-1,-1,-1,-1,0,0,0
1,0,1,0,0,1,1,674.0,2,1,1,2011,-1,-1,-1,-1,0,0,0
2,0,2,0,0,2,1,2268.0,2,1,1,2011,-1,-1,-1,-1,0,0,0
3,0,3,0,1,3,1,528.0,2,1,1,2011,-1,-1,-1,-1,0,0,0
4,0,4,0,1,4,1,28.0,2,1,1,2011,-1,-1,-1,-1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
135865,9,2,2,0,65,1941,2632.0,3,2,5,2016,-1,-1,-1,-1,0,0,0
135866,9,3,2,1,66,1941,305.0,3,2,5,2016,-1,-1,-1,-1,0,0,0
135867,9,4,2,1,67,1941,37.0,3,2,5,2016,-1,-1,-1,-1,0,0,0
135868,9,5,2,2,68,1941,723.0,3,2,5,2016,-1,-1,-1,-1,0,0,0
135869,9,6,2,2,69,1941,208.0,3,2,5,2016,-1,-1,-1,-1,0,0,0

In [195]:
temp.keys()

Index(['store_id', 'dept_id', 'state_id', 'cat_id', 'Node', 'd', 'sold',
       'weekday', 'wday', 'month', 'year', 'event_name_1', 'event_type_1',
       'event_name_2', 'event_type_2', 'snap_CA', 'snap_TX', 'snap_WI'],
      dtype='object')

In [196]:
dataset = temp[['Node','d', 'store_id', 'dept_id', 'state_id', 'cat_id',
       'weekday', 'wday', 'month', 'year', 'event_name_1', 'event_type_1',
       'event_name_2', 'event_type_2', 'snap_CA', 'snap_TX', 'snap_WI', 'sold']]

In [197]:
dataset

,Node,d,store_id,dept_id,state_id,cat_id,weekday,wday,month,year,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI,sold
0,0,1,0,0,0,0,2,1,1,2011,-1,-1,-1,-1,0,0,0,297.0
1,1,1,0,1,0,0,2,1,1,2011,-1,-1,-1,-1,0,0,0,674.0
2,2,1,0,2,0,0,2,1,1,2011,-1,-1,-1,-1,0,0,0,2268.0
3,3,1,0,3,0,1,2,1,1,2011,-1,-1,-1,-1,0,0,0,528.0
4,4,1,0,4,0,1,2,1,1,2011,-1,-1,-1,-1,0,0,0,28.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
135865,65,1941,9,2,2,0,3,2,5,2016,-1,-1,-1,-1,0,0,0,2632.0
135866,66,1941,9,3,2,1,3,2,5,2016,-1,-1,-1,-1,0,0,0,305.0
135867,67,1941,9,4,2,1,3,2,5,2016,-1,-1,-1,-1,0,0,0,37.0
135868,68,1941,9,5,2,2,3,2,5,2016,-1,-1,-1,-1,0,0,0,723.0
135869,69,1941,9,6,2,2,3,2,5,2016,-1,-1,-1,-1,0,0,0,208.0

In [198]:
# sales.to_pickle('../M5_Dataset/sales.pkl')
# prices.to_pickle('../M5_Dataset/prices.pkl')
# calendar.to_pickle('../M5_Dataset/calendar.pkl')

temp.to_pickle('../M5_Dataset/dataset.pkl')

## Prices

In [70]:
prices

        store_id        item_id  wm_yr_wk  sell_price
0           CA_1  HOBBIES_1_001     11325    9.578125
1           CA_1  HOBBIES_1_001     11326    9.578125
2           CA_1  HOBBIES_1_001     11327    8.257812
3           CA_1  HOBBIES_1_001     11328    8.257812
4           CA_1  HOBBIES_1_001     11329    8.257812
...          ...            ...       ...         ...
6841116     WI_3    FOODS_3_827     11617    1.000000
6841117     WI_3    FOODS_3_827     11618    1.000000
6841118     WI_3    FOODS_3_827     11619    1.000000
6841119     WI_3    FOODS_3_827     11620    1.000000
6841120     WI_3    FOODS_3_827     11621    1.000000

[6841121 rows x 4 columns]

In [82]:
prices['dept_id'] = prices['item_id'].apply(lambda x: x.split('_')[0] + '_' + x.split('_')[1]).astype('category')

In [83]:
prices

        store_id        item_id  wm_yr_wk  sell_price    dept_id
0           CA_1  HOBBIES_1_001     11325    9.578125  HOBBIES_1
1           CA_1  HOBBIES_1_001     11326    9.578125  HOBBIES_1
2           CA_1  HOBBIES_1_001     11327    8.257812  HOBBIES_1
3           CA_1  HOBBIES_1_001     11328    8.257812  HOBBIES_1
4           CA_1  HOBBIES_1_001     11329    8.257812  HOBBIES_1
...          ...            ...       ...         ...        ...
6841116     WI_3    FOODS_3_827     11617    1.000000    FOODS_3
6841117     WI_3    FOODS_3_827     11618    1.000000    FOODS_3
6841118     WI_3    FOODS_3_827     11619    1.000000    FOODS_3
6841119     WI_3    FOODS_3_827     11620    1.000000    FOODS_3
6841120     WI_3    FOODS_3_827     11621    1.000000    FOODS_3

[6841121 rows x 5 columns]

In [87]:
prices.drop(['item_id'], axis=1, inplace=True)

In [88]:
prices

        store_id  wm_yr_wk  sell_price    dept_id
0           CA_1     11325    9.578125  HOBBIES_1
1           CA_1     11326    9.578125  HOBBIES_1
2           CA_1     11327    8.257812  HOBBIES_1
3           CA_1     11328    8.257812  HOBBIES_1
4           CA_1     11329    8.257812  HOBBIES_1
...          ...       ...         ...        ...
6841116     WI_3     11617    1.000000    FOODS_3
6841117     WI_3     11618    1.000000    FOODS_3
6841118     WI_3     11619    1.000000    FOODS_3
6841119     WI_3     11620    1.000000    FOODS_3
6841120     WI_3     11621    1.000000    FOODS_3

[6841121 rows x 4 columns]

In [98]:
price_groupby = prices.groupby(['store_id', 'wm_yr_wk', 'dept_id']).mean()

In [ ]:
price_groupby['store_id']

In [99]:
1941*70

135870

In [100]:
price_groupby

                               sell_price
store_id wm_yr_wk dept_id
CA_1     11101    FOODS_1        2.988281
                  FOODS_2        3.808594
                  FOODS_3        2.830078
                  HOBBIES_1      4.773438
                  HOBBIES_2      2.982422
...                                   ...
WI_3     11621    FOODS_3        2.912109
                  HOBBIES_1      6.609375
                  HOBBIES_2      2.578125
                  HOUSEHOLD_1    5.183594
                  HOUSEHOLD_2    5.773438

[19740 rows x 1 columns]